Autodesk.Revit.DB.DirectShapeRoomBoundingOption
An enumerated type containing possible room bounding settings for DirectShapes.
Since:
2016
Since:
2016

Autodesk.Revit.DB.DirectShapeRoomBoundingOption.SetByParameter
The associated DirectShape has a room bounding parameter which is which is writeable and defaults to on.
If can be toggled by a user or the API (by accessing the parameter WALL_ATTR_ROOM_BOUNDING).

Autodesk.Revit.DB.DirectShapeRoomBoundingOption.NotApplicable
The associated DirectShape doesn't have a room bounding parameter, and isn't allowed to.
Trying to change to this value will result in an exception.
Trying to change from this value is restricted to DirectShapes that can be room bounding.